In [1]:
import pandas as pd

In [2]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'last': ['Schafer', 'Doe', 'Doe'],
    'email': ['CoreymSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [9]:
df = pd.read_csv('data/survey_results_public.csv', index_col='Respondent')
schema_df = pd.read_csv('data/survey_results_schema.csv', index_col='Column')

df2 = pd.DataFrame(people)

#pd.set_option('display.max_columns', 85)
#pd.set_option('display.max_rows', 85)

In [10]:
df2['first'] + ' ' + df2['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [11]:
df2['full_name'] = df2['first'] + ' ' + df2['last']

In [12]:
df2

   first     last                    email      full_name
0  Corey  Schafer  CoreymSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [14]:
df2.drop(columns=['first', 'last'])

                     email      full_name
0  CoreymSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [15]:
df2

   first     last                    email      full_name
0  Corey  Schafer  CoreymSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [16]:
df2.drop(columns=['first', 'last'], inplace=True)

In [17]:
df2

                     email      full_name
0  CoreymSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [18]:
df2['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [19]:
df2['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [23]:
df2[['first', 'last']] = df2['full_name'].str.split(' ', expand=True)

In [24]:
df2

                     email      full_name  first     last
0  CoreymSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [25]:
df2.append({'first': 'Tony'})

TypeError: Can only append a Series if ignore_index=True or if the Series has a name

In [26]:
df2.append({'first': 'Tony'}, ignore_index=True)

                     email      full_name  first     last
0  CoreymSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [27]:
people = {
    'first': ['Tony', 'Steve'],
    'last': ['Stark', 'Rogers'],
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}

In [28]:
df3 = pd.DataFrame(people)

In [29]:
df3

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [30]:
df2.append(df3, ignore_index=True)  # gives error, in feature version this will not be an error

C:\Users\lboerhoop\Anaconda3\envs\nlp_course\lib\site-packages\pandas\core\frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

                     email  first      full_name     last
0  CoreymSchafer@gmail.com  Corey  Corey Schafer  Schafer
1        JaneDoe@email.com   Jane       Jane Doe      Doe
2        JohnDoe@email.com   John       John Doe      Doe
3       IronMan@avenge.com   Tony            NaN    Stark
4           Cap@avenge.com  Steve            NaN   Rogers

In [31]:
df2.append(df3, ignore_index=True, sort=False)   # setting sort=False removes error

                     email      full_name  first     last
0  CoreymSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [32]:
df2 = df2.append(df3, ignore_index=True, sort=False)

In [33]:
df2

                     email      full_name  first     last
0  CoreymSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [34]:
df2.drop(index=4)

                     email      full_name  first     last
0  CoreymSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [35]:
df2.drop(index=4, inplace=True)

In [36]:
df2

                     email      full_name  first     last
0  CoreymSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [37]:
df2.drop(index=df[df['last'] == 'Doe'].index)

                     email      full_name  first     last
0  CoreymSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark

In [39]:
df2 = df2.drop(index=df[df['last'] == 'Doe'].index)

In [40]:
df2

                     email      full_name  first     last
0  CoreymSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark

In [43]:
filt = df['last'] == 'Stark'
df2 = df2.drop(index=df[filt].index)

In [44]:
df2

                     email      full_name  first     last
0  CoreymSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark